# SimplyHired Scraped Data Cleaning
##### Dated on: 19 - 04 - 2023

In [69]:
import pandas as pd

In [70]:
df = pd.read_csv('/home/pearlruby/Project/SimplyHired Scraping Script/sample.csv')
df.head()

,Title,Company,Location,Qualifications,Url
0,Data Scientist,Internatinal Scientific Research and Publications,"Chennai, Tamil Nadu",[],https://www.simplyhired.co.in/job/iN4jGuarlOpO...
1,Data Scientist,Deloitte,"Chennai, Tamil Nadu","['Design patterns', 'Azure', 'SQL', 'PyTorch',...",https://www.simplyhired.co.in/job/Si4NFKGVDKO9...
2,Senior Data Scientist,Kroll,"Hyderabad, Telangana","['Project management', 'Analysis skills', 'Azu...",https://www.simplyhired.co.in/job/VMl0QIFIndL6...
3,Assistant Manager - US Innovation Data Scienti...,Deloitte,"Bengaluru, Karnataka","['Sage', 'Power BI', 'D3.js', 'Azure', 'PyTorc...",https://www.simplyhired.co.in/job/EyhxhGR5MVNZ...
4,Data Scientist,Mercedes-Benz Research and Development India P...,"Bengaluru, Karnataka","['OOP', 'Machine learning', 'Python', 'Forecas...",https://www.simplyhired.co.in/job/E6BkS1JT4PzO...

The data frame looks raw. So it needs some cleaning and preprocessing.

In [71]:
df.describe()

,Title,Company,Location,Qualifications,Url
count,1333,1333,1333,1351,1351
unique,517,791,86,923,997
top,Data Scientist,Eightfold.AI,"Bengaluru, Karnataka","['TensorFlow', 'C++', 'Scala', 'APIs', 'Hadoop...",https://www.simplyhired.co.in/job/tvMd_2YrcOGZ...
freq,271,90,411,90,95

* The highest number of posts of job title is Data Scientist.
* The highest number of posts of company is Eightfold.AI. 
* Many job posts have Bengaluru in Karnataka as the work city.

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1351 entries, 0 to 1350
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Title           1333 non-null   object
 1   Company         1333 non-null   object
 2   Location        1333 non-null   object
 3   Qualifications  1351 non-null   object
 4   Url             1351 non-null   object
dtypes: object(5)
memory usage: 52.9+ KB

In [73]:
for i in df.columns:
    print(f'Column {i} has {len(df[i].unique())} unique values')

Column Title has 518 unique values
Column Company has 792 unique values
Column Location has 87 unique values
Column Qualifications has 923 unique values
Column Url has 997 unique values

In [74]:
for i in df.columns:
    count = 0
    for j in df[i]:
        if j == '[]':
            count += 1
            
    print(f'Column {i} has {count} unwanted string objects')

Column Title has 0 unwanted string objects
Column Company has 0 unwanted string objects
Column Location has 0 unwanted string objects
Column Qualifications has 35 unwanted string objects
Column Url has 0 unwanted string objects

In [75]:
df.isnull().sum()

Title             18
Company           18
Location          18
Qualifications     0
Url                0
dtype: int64

In [76]:
df = df.replace('[]', None).dropna(how = 'any')

In [77]:
df['Location'] = [element.split(', ') for element in df['Location']]

In [78]:
A = []
B = []
for i in df['Location']:
    if len(i) < 2:
        A += ['None']
        B += ['None']
    else:
        A += [i[0]]
        B += [i[1]]
        
df['City'] = pd.Series(A)
df['State'] = pd.Series(B)

In [79]:
df['Qualifications'] = df['Qualifications'].str.replace('[', '')
df['Qualifications'] = df['Qualifications'].str.replace(']', '') 
df['Qualifications'] = df['Qualifications'].str.replace('\'', '')
df['Qualifications'] = df['Qualifications'].str.replace('"', '')
#df['Qualifications'] = df['Qualifications'].str.replace("'", '')

/tmp/ipykernel_8642/75477345.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Qualifications'] = df['Qualifications'].str.replace('[', '')
/tmp/ipykernel_8642/75477345.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Qualifications'] = df['Qualifications'].str.replace(']', '')

In [80]:
df['Qualifications'] = df['Qualifications'].str.lower()

In [81]:
df['City'] = df['City'].str.lower()
df['State'] = df['State'].str.lower()

In [82]:
df = df.drop('Location', axis = 1)

In [83]:
df['Company'] = df['Company'].str.lower()

In [84]:
A = []
B = []
for i in df['Title']:
    i = i.split(' - ')
    if len(list(i)) < 2:
        A += [i[0]]
        B += ['None']
    else:
        A += [i[0]]
        B += [i[1]]

df['Title 1'] = pd.Series(A)
df['Title 2'] = pd.Series(B)

In [85]:
df['Title 1'] = df['Title 1'].str.lower()
df['Title 2'] = df['Title 2'].str.lower()

df = df.drop('Title', axis = 1)

In [86]:
count = 0
for i in df['City']:
    if i == 'none':
        count += 1
        
print('No of none string in City column:', count)

No of none string in City column: 181

In [87]:
count = 0
for i in df['State']:
    if i == 'none':
        count += 1
        
print('No of none string in State column:', count)

No of none string in State column: 181

In [88]:
count = 0
for i in df['Title 1']:
    if i == 'none':
        count += 1
        
print('No of none string in Title 1 column:', count)

No of none string in Title 1 column: 0

In [89]:
count = 0
for i in df['Title 2']:
    if i == 'none':
        count += 1
        
print('No of none string in Title 2 column:', count)

No of none string in Title 2 column: 1043

In [90]:
df.describe()

,Company,Qualifications,Url,City,State,Title 1,Title 2
count,1316,1316,1316,1287,1287,1287,1287
unique,777,922,981,74,25,434,86
top,eightfold.ai,"tensorflow, c++, scala, apis, hadoop, b.sc, ba...",https://www.simplyhired.co.in/job/tvMd_2YrcOGZ...,bengaluru,karnataka,data scientist,none
freq,90,90,90,402,407,313,1043

In [91]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1316 entries, 1 to 1350
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Company         1316 non-null   object
 1   Qualifications  1316 non-null   object
 2   Url             1316 non-null   object
 3   City            1287 non-null   object
 4   State           1287 non-null   object
 5   Title 1         1287 non-null   object
 6   Title 2         1287 non-null   object
dtypes: object(7)
memory usage: 82.2+ KB

In [92]:
df[df.duplicated()]

,Company,Qualifications,Url,City,State,Title 1,Title 2
79,united group of initiatives,".net, teaching experience, communication skill...",https://www.simplyhired.co.in/job/1Q5HTnkHVLXW...,bengaluru,karnataka,data scientist,none
309,eightfold.ai,"tensorflow, c++, scala, apis, hadoop, b.sc, ba...",https://www.simplyhired.co.in/job/tvMd_2YrcOGZ...,mumbai,maharashtra,data scientist,none
331,dtcc,"power bi, sql, tableau, sharepoint, informatica",https://www.simplyhired.co.in/job/OHVLXTK5OsdV...,none,none,machine learning engineer,none
354,eightfold.ai,"tensorflow, c++, scala, apis, hadoop, b.sc, ba...",https://www.simplyhired.co.in/job/tvMd_2YrcOGZ...,mumbai,maharashtra,data scientist,none
358,dtcc,"power bi, sql, tableau, sharepoint, informatica",https://www.simplyhired.co.in/job/OHVLXTK5OsdV...,bengaluru,karnataka,data scientist,none
...,...,...,...,...,...,...,...
1346,eightfold.ai,"tensorflow, c++, scala, apis, hadoop, b.sc, ba...",https://www.simplyhired.co.in/job/tvMd_2YrcOGZ...,NaN,NaN,NaN,NaN
1347,cimmyt,"gis, stata, data collection, communication ski...",https://www.simplyhired.co.in/job/z5sHRDt1VPux...,NaN,NaN,NaN,NaN
1348,wesco,"project management, azure, spark, mysql, strat...",https://www.simplyhired.co.in/job/72QBxvbB0YPA...,NaN,NaN,NaN,NaN
1349,eightfold.ai,"tensorflow, c++, scala, apis, hadoop, b.sc, ba...",https://www.simplyhired.co.in/job/tvMd_2YrcOGZ...,NaN,NaN,NaN,NaN
1350,cimmyt,"gis, stata, data collection, communication ski...",https://www.simplyhired.co.in/job/z5sHRDt1VPux...,NaN,NaN,NaN,NaN

There are 335 entries as duplicates. They have no use to the analysis. So they are removed from the relational tabule.

In [93]:
df = df.drop_duplicates()

df = df.reset_index()
df = df.drop('index', axis = 1)

After removing the duplicate rows, the data frame is re-indexed.

In [94]:
df.isnull().sum()

Company           0
Qualifications    0
Url               0
City              3
State             3
Title 1           3
Title 2           3
dtype: int64

In [95]:
df = df.dropna()

In [96]:
df.isnull().sum()

Company           0
Qualifications    0
Url               0
City              0
State             0
Title 1           0
Title 2           0
dtype: int64

In [97]:
df.to_csv('sample (cleaned).csv', index = True)